# Валидные данные для авторизации
valid_email = 'djo00@mail.ru'
valid_password = '12345'
# ------------------------------------------------------------------------------------------------

# Не валидные данные для авторизации
invalid_email = 'dj00@mail.ru'
invalid_password = '54321'
invalid_auth_key = {
  "key": "ea738148a1f19838e1c3731380e733e877b0ae729"
}
rotten_auth_key = {
  "key": "ea738148a1f19838e1c5d1413877f3691a3731380e733e877b0ae72"
}
# -----------------------------------------------------------------------------------------------


# Данные для добавления питомца
add_name = 'Василий'
add_age = '10'
add_animal_type = 'Python'
add_pet_photo = 'images/cat1.jpg'
# -----------------------------------------------------------------------------------------------

# Данные для обновления информации о питомце
update_name = 'Рыжий'
update_age = '5'
update_animal_type = 'Java'
update_pet_photo = 'images/cat2.jpeg'
# ----------------------------------------------------------------------------------------------


def generate_string(num):
    return "x" * num


def russian_chars():
    return 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'


def chinese_chars():
    return '的一是不了人我在有他这为之大来以个中上们'


def special_chars():
    return '|\\/!@#$%^&*()-_=+`~?"№;:[]{}'







